Tekla Open API Reference for Tekla Structures 2025
ReportTemplateElement Class
 The ReportTemplateElement class represents a template in the Tekla Structures template library.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.ElementBase
 Tekla.Structures.Drawing.ReportTemplateElement
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ReportTemplateElement : ElementBase
<SerializableAttribute>
Public NotInheritable Class ReportTemplateElement
	Inherits ElementBase
The ReportTemplateElement type exposes the following members.
Constructors
Name | Description
ReportTemplateElement()
 Creates a new report template element instance with the default template.
ReportTemplateElement(TemplateInfo)
 Creates a new report template element instance with the given template.
Top
Properties
Name | Description
Template
 The template.
Top
Methods
Name | Description
Clone
 Clones the object.
 (Overrides ElementBase.Clone().)
GetUnformattedString
 Returns the content as a string without formatting.
 (Overrides ElementBase.GetUnformattedString().)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ElementBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace